In [2]:
import pandas as pd
import numpy as np

### pandas

In [3]:
data_value = np.array([['a', 'b', 'c'], ['b', 'c', 'c'], ['d', 'c', 'a']])
data_value.shape

(3, 3)

In [9]:
dataset = pd.DataFrame(data_value, columns = ['col1', 'col2', 'col3'])
dataset

  col1 col2 col3
0    a    b    c
1    b    c    c
2    d    c    a

##### add one row

In [21]:
add_value = pd.Series(['c', 'd', 'e'], index = dataset.columns)
dataset.append(add_value, ignore_index = True)

  col1 col2 col3
0    a    b    c
1    b    c    c
2    d    c    a
3    c    d    e

In [22]:
dataset

  col1 col2 col3
0    a    b    c
1    b    c    c
2    d    c    a

In [27]:
dataset = dataset.append(add_value, ignore_index = True)
dataset

  col1 col2 col3
0    a    b    c
1    b    c    c
2    d    c    a
3    c    d    e

##### add columns

In [28]:
dataset['col4'] = pd.Series(['c', 'd', 'd', 'a'])
dataset

  col1 col2 col3 col4
0    a    b    c    c
1    b    c    c    d
2    d    c    a    d
3    c    d    e    a

In [37]:
data_value_dic = {
    'name':['aaa', 'bbb', 'ccc'],
    'color':['red', 'blue', 'white'],
    'price':[12, 34, 56]
}
dataset_from_dic = pd.DataFrame(data_value_dic)
dataset_from_dic

  name  color  price
0  aaa    red     12
1  bbb   blue     34
2  ccc  white     56

In [38]:
column_value = ['big', 'small', 'small']
dataset_from_dic['size'] = column_value
dataset_from_dic

  name  color  price   size
0  aaa    red     12    big
1  bbb   blue     34  small
2  ccc  white     56  small

In [39]:
dataset_from_dic.insert(loc = 0, column = 'ID', value = [1, 2, 3], allow_duplicates = True)
dataset_from_dic

   ID name  color  price   size
0   1  aaa    red     12    big
1   2  bbb   blue     34  small
2   3  ccc  white     56  small

In [41]:
dataset_from_dic = dataset_from_dic.assign(discount = [0.1, 0.2, 0.3])
dataset_from_dic

   ID name  color  price   size  discount
0   1  aaa    red     12    big       0.1
1   2  bbb   blue     34  small       0.2
2   3  ccc  white     56  small       0.3

In [42]:
add_value_by_one_column = {'12':'aaa', '2':'bbb', '3':'ccc'}
dataset_from_dic['quality'] = add_value_by_one_column
dataset_from_dic

   ID name  color  price   size  discount quality
0   1  aaa    red     12    big       0.1      12
1   2  bbb   blue     34  small       0.2       2
2   3  ccc  white     56  small       0.3       3